CREATE TABLE IF NOT EXISTS faqs (
    faq_id INT PRIMARY KEY AUTO_INCREMENT,
    faq_type VARCHAR(100) NOT NULL,
    faq_title VARCHAR(255) NOT NULL,
    faq_answer TEXT NOT NULL
);

TRUNCATE TABLE faqs;

INSERT INTO faqs (
    faq_type, faq_title, faq_answer
) VALUES 
('Recimo商城', 'Recimo 商城賣什麼？與食譜有什麼關係？', '我們專門販售由「官方食譜」轉化而成的即食料理包。您可以將其視為食譜的實體縮影，讓您省去備料繁瑣，在家也能快速還原與官方食譜一模一樣的美味。'),
('Recimo商城', '下單後多久會出貨？', '待管理員在後台確認訂單後，通常於 1-2 個工作天內完成備貨並出貨。出貨後，您會收到「商品運送進度通知」。'),
('Recimo商城', '如果收到料理包後發現品質有問題該怎麼辦？', '請立即拍照並透過網站的「聯絡我們表單」反映。管理員會在後台查看您的訂單詳情並進行售後處理。'),
('Recimo功能', '沒登入可以使用網站嗎？', '未登入狀態下，您可以瀏覽「食譜總覽」並使用「靈感廚房」小遊戲。但若要使用個人筆記、備餐計畫，則需註冊 Recimo ID。'),
('Recimo功能', '可以把別人食譜排進「備餐計劃」嗎？', '可以，只需點擊食譜下方的「加入收藏」，即可在行事曆介面中拖曳排入。'),
('食譜與社群', '可以怎麼「改編食譜」？', '當您參考官方食譜想加入自己的創意時，可以點擊食譜內頁的「筆/編輯食譜/改編食譜」的按鈕，進行編輯。不必擔心會修改到官方食譜，系統會保留原食譜，完成改編後您的改編食譜會上傳至原食譜內頁中「改編輯」內。'),
('食譜與社群', '留言被檢舉會發生什麼事？', '若留言違反社群守則並經管理員審核屬實，該留言將被移除，您也會在登入後頁面中的「小鈴鐺」收到通知。');