-- phpMyAdmin SQL Dump
-- version 5.1.2
-- https://www.phpmyadmin.net/
--
-- 主機： localhost:8889
-- 產生時間： 2026-02-01 03:22:42
-- 伺服器版本： 5.7.24
-- PHP 版本： 8.3.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `tibamefe_cjd102g2`
--

-- --------------------------------------------------------

--
-- 資料表結構 `products`
--

CREATE TABLE `products` (
  `product_id` int(11) NOT NULL,
  `product_name` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `product_category` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `product_image` json NOT NULL,
  `product_description` varchar(1000) COLLATE utf8mb4_unicode_ci NOT NULL,
  `product_price` decimal(10,2) NOT NULL,
  `product_kcal` decimal(10,2) DEFAULT NULL,
  `product_carbs` decimal(5,2) DEFAULT NULL,
  `product_fat` decimal(5,2) DEFAULT NULL,
  `product_fiber` decimal(5,2) DEFAULT NULL,
  `product_protein` decimal(5,2) DEFAULT NULL,
  `product_saturated_fat` decimal(5,2) DEFAULT NULL,
  `product_sugar` decimal(5,2) DEFAULT NULL,
  `product_sodium` decimal(10,2) DEFAULT NULL,
  `product_net_weight` decimal(10,2) NOT NULL,
  `product_ingredients` varchar(1000) COLLATE utf8mb4_unicode_ci NOT NULL,
  `product_cooking_method` varchar(1000) COLLATE utf8mb4_unicode_ci NOT NULL,
  `product_storage_method` varchar(40) COLLATE utf8mb4_unicode_ci NOT NULL,
  `product_reminder` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `product_release` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `products`
--

INSERT INTO `products` (`product_id`, `product_name`, `product_category`, `product_image`, `product_description`, `product_price`, `product_kcal`, `product_carbs`, `product_fat`, `product_fiber`, `product_protein`, `product_saturated_fat`, `product_sugar`, `product_sodium`, `product_net_weight`, `product_ingredients`, `product_cooking_method`, `product_storage_method`, `product_reminder`, `product_release`) VALUES
(1, '舒肥雞胸藜麥飯', '低卡健身系列', '[{\"id\": 1, \"is_cover\": true, \"image_url\": \"img/mall/PROD-001_01.jpg\"}, {\"id\": 2, \"is_cover\": false, \"image_url\": \"img/mall/PROD-001_02.jpg\"}, {\"id\": 3, \"is_cover\": false, \"image_url\": \"img/mall/PROD-001_03.jpg\"}]', '想吃得健康，又不想犧牲美味？我們的「舒肥雞胸藜麥飯」專為忙碌的現代人、健身族與體重管理者設計。採用低溫烹調技術鎖住肉汁，搭配超級食物大軍，讓你每一口都吃進飽足感與純淨營養。', '160.00', '250.00', '42.00', '4.20', '0.00', '28.00', '0.00', '0.00', '0.00', '250.00', '1.嚴選低溫舒肥嫩雞胸。\r\n2.黃金兩色藜麥糙米飯(三色藜麥、優質糙米)。\r\n3.五彩均衡鮮蔬(青花菜、鮮甜紅蘿蔔 / 黃玉米筍、栗子地瓜 / 烤南瓜、毛豆仁)。', '1.微波加熱：撕開包裝一角以800W 加熱約2-3分鐘。\r\n2.隔水加熱：整包放入熱水中浸泡5-8分鐘(不建議沸騰加熱以維持肉質嫩度)。\r\n3.電鍋加熱：解凍後放入內鍋，外鍋加少許水，跳起即可。', '冷凍 -18度 以下可保存 12 個月。', '本產品含有穀類製品，過敏者請留意。', 1),
(2, '香煎鮭魚糙米便當', '低卡健身系列', '[{\"id\": 1, \"is_cover\": true, \"image_url\": \"img/mall/PROD-002_01.jpg\"}, {\"id\": 2, \"is_cover\": false, \"image_url\": \"img/mall/PROD-002_02.jpg\"}, {\"id\": 3, \"is_cover\": false, \"image_url\": \"img/mall/PROD-002_03.jpg\"}]', '「每一口都是山海與大地的交織。」 掀開餐盒，首先映入眼簾的是煎得焦香亮澤的鮭魚排，撒上少許黑胡椒與海鹽提味，入口即化；搭配著散發淡淡稻米香氣的糙米飯，咀嚼間能感受到層次分明的口感。配菜的鮮甜則平衡了魚肉的油脂，讓整份便當吃起來清爽無壓力。', '220.00', '580.00', '72.50', '4.20', '8.00', '35.00', '6.00', '5.00', '800.00', '480.00', '1.嚴選阿拉斯加鮭魚。\r\n2.季節時蔬與配菜(綠色蔬菜、玉米筍或是地瓜等)。\r\n3.Q彈糙米飯。', '1.微波加熱：噴灑少許水於米飯上，中火加熱 2-3 分鐘。\r\n2.電鍋加熱：外鍋放入半杯水，跳起後燜 5 分鐘即可。', '冷凍 -18度 以下可保存 12 個月。', '本產品含有魚類及蛋類，過敏者請留意。', 1),
(3, '蒜香毛豆嫩豬排', '低卡健身系列', '[{\"id\": 7, \"is_cover\": true, \"image_url\": \"img/mall/PROD-003_01.jpg\", \"sort_order\": 1}, {\"id\": 8, \"is_cover\": false, \"image_url\": \"img/mall/PROD-003_02.jpg\", \"sort_order\": 2}, {\"id\": 9, \"is_cover\": false, \"image_url\": \"img/mall/PROD-003_03.jpg\", \"sort_order\": 3}]', '這款料理包選用台灣在地活菌豬，搭配飽滿翠綠的非基改毛豆，並注入大量爆香蒜碎。豬排經過獨家斷筋技術處理，口感滑嫩不乾柴，每一口都能品嚐到濃郁的蒜香與豆香。', '180.00', '318.00', '15.00', '14.20', '2.50', '32.50', '8.00', '6.00', '1000.00', '200.00', '1.嚴選秘製嫩豬排。\n2.清甜毛豆仁。\n3.職人調味特製蒜蓉醬包。', '1.香煎：熱鍋倒入少許油，將豬排雙面各煎約 1.5 分鐘至金黃色。\n2.拌炒：加入毛豆仁與特製蒜蓉醬包，快速翻炒約 1 分鐘，待醬汁收乾鎖入肉質。', '冷凍 -18度 以下可保存 12 個月。', '本產品含有大豆及其製品和含麩質之穀物及其製品，過敏者請留意。', 1),
(4, '豆腐漢堡排佐野菇', '低卡健身系列', '[{\"id\": 10, \"is_cover\": true, \"image_url\": \"img/mall/PROD-004_01.jpg\", \"sort_order\": 1}, {\"id\": 11, \"is_cover\": false, \"image_url\": \"img/mall/PROD-004_02.jpg\", \"sort_order\": 2}, {\"id\": 12, \"is_cover\": false, \"image_url\": \"img/mall/PROD-004_03.jpg\", \"sort_order\": 3}]', '打破你對健康料理「淡而無味」的刻板印象！ 我們選用非基因改造黃豆製作的嫩豆腐，打造出如雲朵般綿密軟嫩的漢堡排。搭配細火慢燉的綜合野菇芡汁，濃郁的蕈菇香氣與清爽的漢堡排完美融合，是一道讓身體零負擔、心靈大滿足的精緻主食。', '150.00', '232.00', '2.00', '11.60', '2.50', '18.50', '4.00', '6.00', '1000.00', '200.00', '1.非基因改造板豆腐漢堡排。\n2.新鮮洋蔥。\n3.新鮮蕈菇類： 香菇、鴻喜菇、雪白菇、金針菇(切段或切片，增加多層次咬感)。\n4.職人調配野菇醬。', '1.微波加熱：解凍後，撕開包裝倒入盤中，強火 微波 2-3 分鐘。\n2.進階吃法(推薦)：解凍後，將漢堡排取出用平底鍋稍微煎至兩面微焦，再淋上加熱後的野菇醬，香氣更升級！', '冷凍 -18度 以下可保存 12 個月。', '本產品含有大豆(豆腐/醬油)。', 1),
(5, '檸檬紙包魚片', '低卡健身系列', '[{\"id\": 13, \"is_cover\": true, \"image_url\": \"img/mall/PROD-005_01.jpg\", \"sort_order\": 1}, {\"id\": 14, \"is_cover\": false, \"image_url\": \"img/mall/PROD-005_02.jpg\", \"sort_order\": 2}, {\"id\": 15, \"is_cover\": false, \"image_url\": \"img/mall/PROD-005_03.jpg\", \"sort_order\": 3}]', '選用肉質細緻的頂級白肉魚片(如鱸魚或鯛魚)，搭配新鮮切片黃檸檬與特調義式香料醬汁。不需動油鍋，僅需進烤箱或氣炸鍋，即可享受宛如高級餐館現做的鮮甜滋味。', '210.00', '215.00', '6.40', '8.20', '2.50', '28.50', '2.50', '3.00', '800.00', '150.00', '1.優質白肉魚片(去刺)。\n2.蔬菜：鮮甜蘆筍、彩色甜椒、黃節瓜、新鮮黃檸檬片。\n3.新鮮洋蔥。\n4.調味醬包：初榨橄欖油、海鹽、黑胡椒、蒜末、迷悉香、白葡萄酒。', '1.烤箱(推薦)：烤箱預熱至 200°C，將魚片與蔬菜放入紙包中，淋上醬汁並密封。放入烤箱烘烤 15–18 分鐘 即可。\n2.氣炸鍋：溫度設定 180°C，將紙包密封好放入，氣炸約 12–15 分鐘。', '冷凍 -18度 以下可保存 12 個月。', '生產線亦處理甲殼類、大豆、牛奶及其製品，過敏者請留意。', 1),
(6, '日式壽喜燒牛丼', '日韓風味系列', '[{\"id\": 16, \"is_cover\": true, \"image_url\": \"img/mall/PROD-006_01.jpg\", \"sort_order\": 1}, {\"id\": 17, \"is_cover\": false, \"image_url\": \"img/mall/PROD-006_02.jpg\", \"sort_order\": 2}, {\"id\": 18, \"is_cover\": false, \"image_url\": \"img/mall/PROD-006_03.jpg\", \"sort_order\": 3}]', '嚴選油脂分布均勻的優質牛胸腹肉，搭配鮮甜日本洋蔥，浸入由純釀造醬油、味醂、清酒與職人鰹魚高湯調製而成的秘製壽喜燒醬汁。長時間慢火燉煮，肉質鮮嫩不乾柴，每一口都能嚐到鹹甜適中的道地江戶前風味。', '170.00', '386.00', '15.60', '28.40', '1.20', '16.80', '15.00', '20.00', '1200.00', '200.00', '1.嚴選牛胸腹肉：挑選油脂比例適中的美國/澳洲牛肉，切成 1.5mm 最佳口感薄片，確保口感鮮嫩。\r\n2.鮮甜在地洋蔥：採用大量新鮮洋蔥，慢火熬煮至半透明，釋放天然澱粉質與甜味。\r\n3.職人秘製壽喜燒醬。', '1.隔水加熱(推薦)：無需解凍，將料理包直接放入沸水中加熱約 5-7 分鐘，撕開即可淋在飯上。\r\n2.微波加熱：請先將內容物倒入可微波容器中，覆蓋後以 800W 加熱約2-3分鐘。（請勿將鋁箔袋直接放入微波爐）\r\n3.電鍋加熱：解凍後放入碗中，外鍋加入半杯水，蒸至開關跳起即可。\r\n4.主廚私房吃法：趁熱打入一顆溫泉蛋或撒上些許七味粉與紅生薑，風味更具層次感！', '冷凍 -18度 以下可保存 12 個月。', '本產品與其他含有堅果、魚類、奶類、甲殼類、蛋的產品於同一產線生產，食物過敏者請留意。', 1),
(7, '韓式泡菜炒豬肉', '日韓風味系列', '[{\"id\": 19, \"is_cover\": true, \"image_url\": \"img/mall/PROD-007_01.jpg\", \"sort_order\": 1}, {\"id\": 20, \"is_cover\": false, \"image_url\": \"img/mall/PROD-007_02.jpg\", \"sort_order\": 2}, {\"id\": 21, \"is_cover\": false, \"image_url\": \"img/mall/PROD-007_03.jpg\", \"sort_order\": 3}]', '這道經典的韓式家常菜，我們選用熟成恰到好處的發酵老泡菜，搭配油脂分佈均勻的特選豬五花切片。泡菜的酸辣爽脆與豬肉的油脂香氣在鍋中交織，淋上獨門大醬祕製醬汁，每一口都是鹹、香、辣的完美平衡。', '165.00', '462.50', '4.10', '33.80', '3.00', '31.00', '11.00', '12.00', '1600.00', '250.00', '1.道地風味：嚴選韓式發酵泡菜，酸辣帶勁，非一般化學調味。\n2.軟嫩多汁：豬肉預先醃製入味，大火快炒也不乾柴。\n3.職人秘製壽喜燒醬。', '1.隔水加熱(最推薦)：不拆袋直接放入沸水中，加熱約 5-8 分鐘，拆袋倒出即可享用。\n2.平底鍋熱炒(香氣最足)：解凍後拆袋倒入鍋中，加入少許油，中火翻炒 3 分鐘至醬汁微微收乾，香氣更濃郁。\n3.鍋加熱： 解凍後放入碗中，外鍋加入半杯水，蒸至開關跳起即可。\n4.微波加熱：拆袋倒入可微波容器，蓋上上蓋。以 800W 加熱約 3-4 分鐘。\n5. 美味小撇步：出鍋前撒上一把新鮮青蔥段或鋪上一片起司，風味層次更加分！', '冷凍 -18度 以下可保存 6 個月。', '本產品含有大豆、小麥、魚類、甲殼類(蝦)及芝麻，不適合對其過敏體質者食用。', 1),
(8, '北海道咖哩雞', '日韓風味系列', '[{\"id\": 1, \"is_cover\": true, \"image_url\": \"img/mall/PROD-008_01.jpg\"}, {\"id\": 2, \"is_cover\": false, \"image_url\": \"img/mall/PROD-008_02.jpg\"}, {\"id\": 3, \"is_cover\": false, \"image_url\": \"img/mall/PROD-008_03.jpg\"}]', '不同於傳統褐色的辛辣咖哩，我們的北海道白咖哩以優質牛乳與鮮奶油為基底，佐以多種辛香料低溫慢火熬煮。入口是如絲綢般的醇厚乳香，隨之而來的是咖哩的微辛層次，最後帶出在地時蔬的清甜。', '155.00', '420.00', '26.00', '25.20', '2.80', '22.40', '11.00', '16.00', '1200.00', '280.00', '1.嚴選食材：採用新鮮去骨雞腿肉，大塊入味，鮮嫩不乾柴。\r\n2.大地精華：搭配鬆軟馬鈴薯與鮮甜胡蘿蔔，重現道地北海道風味。', '1.隔水加熱：將料理包(無需拆封)放入沸水中，加熱約 5-8 分鐘。\r\n2.微波加熱：撕開包裝倒入微波專用容器，以 800W 加熱約 2-3 分鐘。\r\n3.職人吃法：建議搭配熱騰騰的白飯或剛烤好的法棍麵包，灑上少許荷蘭芹(Parsley)風味更佳。', '冷凍 -18度 以下可保存 12 個月。', '本產品含有牛奶、羊奶、含麩質之穀物及其製品。生產線亦處理甲殼類、蛋、魚類、大豆、芝麻及其製品，過敏者請留意。', 1),
(9, '照燒鮭魚排', '日韓風味系列', '[{\"id\": 25, \"is_cover\": true, \"image_url\": \"img/mall/PROD-009_01.jpg\", \"sort_order\": 1}, {\"id\": 26, \"is_cover\": false, \"image_url\": \"img/mall/PROD-009_02.jpg\", \"sort_order\": 2}, {\"id\": 27, \"is_cover\": false, \"image_url\": \"img/mall/PROD-009_03.jpg\", \"sort_order\": 3}]', '鮭魚富含豐富的 Omega-3 與優質蛋白質，經過低溫醃製入味，煎烤後外皮微焦酥香，內裡魚肉鮮嫩多汁。甜鹹適中的照燒風味，無論是搭配白飯做成「照燒鮭魚丼」，還是配上溫沙拉，都是全家大小最愛的營養首選！', '230.00', '215.00', '5.60', '13.20', '0.00', '18.50', '5.00', '15.00', '1200.00', '150.00', '1.真材實料：嚴選厚切鮭魚，拒絕碎肉組合。\n2.職人秘製醬汁。', '1.香煎法：解凍後，將鮭魚排表面水分稍微拭乾。平底鍋倒入少許油，以中小火兩面各煎約 3 分鐘，最後倒入剩餘醬汁稍微收汁即可。\n2.氣炸鍋：無需解凍，溫度設定 180°C，氣炸 10-12 分鐘(中途可翻面一次)，至表面呈金黃色。\n3.烤箱法：烤箱預熱至 200°C，放入鮭魚排烤約 15 分鐘。', '冷凍 -18度 以下可保存 12 個月。', '本產品含有魚類、大豆及含麩質之穀物(醬油來源)，不適合對其過敏體質者食用。', 1),
(10, '經典義大利肉醬麵', '歐美西式系列', '[{\"id\": 28, \"is_cover\": true, \"image_url\": \"img/mall/PROD-010_01.jpg\", \"sort_order\": 1}, {\"id\": 29, \"is_cover\": false, \"image_url\": \"img/mall/PROD-010_02.jpg\", \"sort_order\": 2}, {\"id\": 30, \"is_cover\": false, \"image_url\": \"img/mall/PROD-010_03.jpg\", \"sort_order\": 3}]', '這不僅是一包肉醬，而是時間的沉澱。我們選用優質紐澳草飼牛與國產豬肉，以7:3黃金比例混合，打造多層次的咬勁與香氣。搭配新鮮番茄、洋蔥、芹菜與胡蘿蔔，經由4小時低溫慢燉，讓蔬菜的清甜完全融入肉汁。每一口都能感受到濃郁番茄酸甜與厚實肉香在舌尖交織。無需繁複煮食，只要幾分鐘，讓家中餐桌瞬間變成道地的義式小餐館。', '145.00', '290.00', '27.60', '13.80', '2.80', '8.50', '10.00', '12.00', '1300.00', '360.00', '1.直人秘製肉醬包。\n2.手工麵條。', '1.水煮加熱(推薦)：將醬包(不拆袋)放入沸水中煮 5 分鐘。同時另鍋煮熟麵條，最後將醬汁淋上即可。\n2.微波加熱：撕開醬包倒入碗中，強火(800W)加熱約 2 分鐘。\n3.職人煮法：醬包解凍後倒入平底鍋，加入煮好的麵條與 20cc 煮麵水，中火拌炒 1 分鐘，讓醬汁吸附在麵條上更美味。', '冷凍 -18度 以下可保存 12 個月。', '本產品含有麩質之穀物(小麥)製品,食物過敏者請留意。', 1),
(11, '奶油松露野菇燉飯', '歐美西式系列', '[{\"id\": 31, \"is_cover\": true, \"image_url\": \"img/mall/PROD-011_01.jpg\", \"sort_order\": 1}, {\"id\": 32, \"is_cover\": false, \"image_url\": \"img/mall/PROD-011_02.jpg\", \"sort_order\": 2}, {\"id\": 33, \"is_cover\": false, \"image_url\": \"img/mall/PROD-011_03.jpg\", \"sort_order\": 3}]', '「極致香氣，瞬間綻放。」當義大利頂級黑松露的獨特木質芬芳，遇上濃郁溫潤的法式鮮奶油，每一口燉飯都包裹著飽滿的菇鮮與奶香。我們堅持選用高品質義大利米與綜合野菇，透過慢火熬煮的濃縮精華，讓您只需 5 分鐘，就能在家中復刻米其林等級的優雅滋味。', '195.00', '495.00', '57.90', '24.60', '5.40', '10.50', '15.00', '8.00', '1200.00', '0.00', '1.燉飯底：義大利產卡納羅利米 (Carnaroli)/ 台灣優質一等米、鮮奶油、奶油、洋蔥、蒜末、蔬菜高湯。\n2.蕈菇類：香菇、杏鮑菇、蘑菇、黑松露醬(黑松露、橄欖油、鹽)。\n3.調味：帕瑪森起司、白葡萄酒、岩鹽、黑胡椒、百里香。', '1.隔水加熱：不拆袋放入沸水中，加熱約 5-8 分鐘即可倒出享用。\n2.微波加熱：拆袋倒入微波專用碗，中火加熱約 3 分鐘(視微波功率調整)。\n3.主廚推薦：倒入平底鍋中，加入 20ml 水或牛奶，小火翻炒至濃稠狀，起鍋前撒上起司粉 or 點綴一點橄欖油，風味更佳。', '冷凍 -18度 以下可保存 6個月。', '本產品含有牛奶及其製品(奶油、起司、鮮奶油)，不適合對其過敏體質者食用。', 1),
(12, '美式紐奧良烤雞翅', '歐美西式系列', '[{\"id\": 34, \"is_cover\": true, \"image_url\": \"img/mall/PROD-012_01.jpg\", \"sort_order\": 1}, {\"id\": 35, \"is_cover\": false, \"image_url\": \"img/mall/PROD-012_02.jpg\", \"sort_order\": 2}, {\"id\": 36, \"is_cover\": false, \"image_url\": \"img/mall/PROD-012_03.jpg\", \"sort_order\": 3}]', '正宗紐奧良風味，開啟味蕾的狂歡盛宴！我們選用肉質Ｑ彈的國產雞翅，加入數十種紐奧良靈魂香料（紅椒、大蒜、黑胡椒及多種香草）低溫長時間醃製。每一口都能感受到煙燻的微甜與辛香料的層次，外皮金黃微焦，肉質滑嫩多汁。', '160.00', '430.00', '28.40', '10.00', '0.00', '33.00', '10.00', '8.00', '1000.00', '200.00', '1.紐奧良醃漬的精選雞翅(三節翅或二節翅)。', '1.氣炸鍋(推薦)：無需解凍，溫度設定180°C，氣炸約12~15 分鐘。中途建議翻面一次，色澤更均勻。\r\n2.烤箱：預熱至200°C，放入烤箱烘烤15~18 分鐘即可。\r\n3.微波爐：撕開包裝一角，以800W中高火加熱約3~5 分鐘(口感較軟嫩，皮不會脆)。', '冷凍 -18度 以下可保存 6個月。', '本產品含有大豆、含麩質之穀物(醬油)及其製品。', 1),
(13, '白酒蒜香蛤蜊麵', '歐美西式系列', '[{\"id\": 37, \"is_cover\": true, \"image_url\": \"img/mall/PROD-013_01.jpg\", \"sort_order\": 1}, {\"id\": 38, \"is_cover\": false, \"image_url\": \"img/mall/PROD-013_02.jpg\", \"sort_order\": 2}, {\"id\": 39, \"is_cover\": false, \"image_url\": \"img/mall/PROD-013_03.jpg\", \"sort_order\": 3}]', '不用精湛廚藝，也能擁有一桌浪漫的義式晚餐。我們選用鮮甜飽滿的蛤蜊，搭配特級初榨橄欖油與大量金黃蒜片，最後以乾爽的白酒提味。每一根麵條都吸飽了海洋的鮮美與酒香的優雅，讓您在家也能享受餐酒館等級的精緻饗宴。', '185.00', '485.00', '65.00', '12.50', '0.00', '18.20', '3.00', '3.00', '1200.00', '350.00', '1.嚴選海味：採用高溫高壓殺菌技術，保留蛤蜊的原汁原味，顆顆鮮甜。\r\n2.靈魂醬汁：大量蒜末與辛香料慢火煸香，白酒香氣層次分明。3.Q彈麵條：進口杜蘭小麥粉製成，口感扎實，微波或拌炒皆能保持彈牙。', '1.平底鍋拌炒(推薦，口感最道地)：將麵條包與醬汁包先行退冰，在平底鍋加入少許油，倒入醬汁包與蛤蜊煮至沸騰，加入麵條均勻拌炒約 1-2 分鐘，待醬汁收濃後即可起鍋。\r\n2.微波加熱：在包裝袋上撕開一個小洞，以 800W 功率微波約 3-4 分鐘，倒出至餐盤中拌勻，灑上內附的香料粉。', '冷凍 -18度 以下可保存 6個月。', '本產品含有甲殼類(蛤蜊)、含麩質之穀物(小麥)及其製品。', 1),
(14, '經典奶油培根義大利麵', '歐美西式系列', '[{\"id\": 40, \"is_cover\": true, \"image_url\": \"img/mall/PROD-014_01.jpg\", \"sort_order\": 1}, {\"id\": 41, \"is_cover\": false, \"image_url\": \"img/mall/PROD-014_02.jpg\", \"sort_order\": 2}, {\"id\": 42, \"is_cover\": false, \"image_url\": \"img/mall/PROD-014_03.jpg\", \"sort_order\": 3}]', '不需要專業廚藝，也能在家還原義大利餐酒館的經典之作。我們選用香醇的厚切培根，搭配法國進口鮮奶油與熟成帕瑪森起司。每一口都能感受到煙燻肉香與溫潤奶香的完美融合，鹹香適中，是大朋友小朋友都無法抗拒的療癒系美食。', '145.00', '245.00', '23.80', '12.50', '0.00', '9.20', '20.00', '6.00', '1400.00', '350.00', '1.杜蘭小麥義大利麵 (Spaghetti)： 選用 100% 杜蘭小麥粉製成。\r\n2.特製奶油起司醬。\r\n3.厚切煙燻培根。', '1.平底鍋加熱：平底鍋加入 30ml 水，倒入醬包與麵條，中火翻炒至醬汁收濃、麵條均勻掛漿即可(約 2 分鐘)。\r\n2.微波加熱：在包裝袋上撕開一個小洞，以 800W 功率微波約 3-4 分鐘，倒出至餐盤中拌勻，灑上內附的香料粉。', '冷凍 -18度 以下可保存 6個月。', '本產品含有牛奶、蛋、含麩質之穀物及其製品，不適合對其過敏體質者食用。', 1),
(15, '台式三杯雞', '台式家常系列', '[{\"id\": 43, \"is_cover\": true, \"image_url\": \"img/mall/PROD-015_01.jpg\", \"sort_order\": 1}, {\"id\": 44, \"is_cover\": false, \"image_url\": \"img/mall/PROD-015_02.jpg\", \"sort_order\": 2}, {\"id\": 45, \"is_cover\": false, \"image_url\": \"img/mall/PROD-015_03.jpg\", \"sort_order\": 3}]', '不用動油鍋，也不用頂著熱氣爆香。我們選用鮮嫩多汁的國產雞腿肉，遵循傳統「一杯麻油、一杯醬油、一杯米酒」的黃金比例，慢火煸香老薑片，最後撒入靈魂九層塔。鹹甜適中、醬汁濃郁，是絕對的「白飯殺手」！', '165.00', '336.00', '9.20', '20.40', '0.00', '29.00', '9.00', '15.00', '1300.00', '200.00', '1.精選國產去骨雞腿肉。\r\n2.老薑片、蒜粒、鮮切九層塔、紅辣椒(微辣提味)。\r\n3.主廚秘製醬汁。', '1.隔水加熱(最推薦)：不拆袋，放入沸水中煮約 5-8 分鐘，即可倒出享用。\r\n2.微波加熱：拆袋倒入微波容器，高火(800W)加熱約 3 分鐘。3.電鍋加熱：拆袋倒入碗中，外鍋加半杯水，跳起即可。', '冷凍 -18度 以下可保存 6個月。', '本產品含有大豆、小麥(醬油來源)及芝麻(麻油來源)，不適合對其過敏體質者食用。', 1),
(16, '家傳紅燒肉', '台式家常系列', '[{\"id\": 46, \"is_cover\": true, \"image_url\": \"img/mall/PROD-016_01.jpg\", \"sort_order\": 1}, {\"id\": 47, \"is_cover\": false, \"image_url\": \"img/mall/PROD-016_02.jpg\", \"sort_order\": 2}, {\"id\": 48, \"is_cover\": false, \"image_url\": \"img/mall/PROD-016_03.jpg\", \"sort_order\": 3}]', '「一塊紅燒肉，是家最溫暖的記憶。」嚴選帶皮五花豬肉，遵循古法長時慢燉。每一塊紅燒肉都呈現琥珀般的誘人光澤，入口即化卻不軟爛，肥而不膩、瘦而不柴。那醇厚濃育的醬香，完美滲透進肉質纖維，淋上一勺精華滷汁，就是三碗白飯也嫌不夠的靈魂美味。', '180.00', '585.00', '12.50', '45.00', '0.00', '32.50', '18.00', '20.00', '1500.00', '250.00', '1.嚴選國產豬五花肉。\r\n2.主廚秘製醬汁。', '1.隔水加熱(最推薦)：不需拆袋，將料理包放入沸水中煮約 8–10 分鐘，即可拆袋享用。\r\n2.微波加熱：拆袋後將內容物倒入微波專用碗，覆蓋後以 800W 加熱約 3–5 分鐘。\r\n3.電鍋加熱：拆袋後放入碗中，外鍋加入半杯水，跳起後即可上桌。', '凍 -18度 以下可保存 6個月。', '本產品含有大豆、小麥(醬油來源)，不適合對其過敏者食用。', 1),
(17, '清蒸蔥油鱸魚', '台式家常系列', '[{\"id\": 49, \"is_cover\": true, \"image_url\": \"img/mall/PROD-017_01.jpg\", \"sort_order\": 1}, {\"id\": 50, \"is_cover\": false, \"image_url\": \"img/mall/PROD-017_02.jpg\", \"sort_order\": 2}, {\"id\": 51, \"is_cover\": false, \"image_url\": \"img/mall/PROD-017_03.jpg\", \"sort_order\": 3}]', '「鎖住大海的鮮甜，只需 10 分鐘，五星級名菜優雅上桌。」還在煩惱處理鮮魚的鱗片與內臟嗎？我們為您精選外銷等級的鮮嫩金目鱸魚，已去骨、去鱗、去內臟並切片處理。搭配特製的秘製蒸魚豉油與爆香蔥油，讓您在家也能輕鬆還原飯店大廚的拿手好菜。', '250.00', '469.70', '6.30', '25.20', '0.00', '54.60', '3.50', '3.00', '1000.00', '350.00', '1.嚴選鱸魚片： 約 250g - 300g(已去刺、清肉)。\r\n2.特調蒸魚醬汁。\r\n3.香蔥風味油。\r\n4.乾燥蔥段/薑絲。', '1.清蒸：拆袋將魚片鋪於盤中，淋上「特調蒸魚醬汁」，放入電鍋(外鍋半杯水)或蒸鍋，大火蒸約 8-10 分鐘。\r\n2.淋油：出爐後撒上蔥絲，將「香蔥風味油」加熱後淋在魚片上(或直接拌入)，即可享用。', '冷凍 -18度 以下可保存 6個月。', '本產品含有大豆、小麥(醬油來源)，不適合對其過敏者食用。', 1),
(18, '麻婆豆腐燒', '台式家常系列', '[{\"id\": 52, \"is_cover\": true, \"image_url\": \"img/mall/PROD-018_01.jpg\", \"sort_order\": 1}, {\"id\": 53, \"is_cover\": false, \"image_url\": \"img/mall/PROD-018_02.jpg\", \"sort_order\": 2}, {\"id\": 54, \"is_cover\": false, \"image_url\": \"img/mall/PROD-018_03.jpg\", \"sort_order\": 3}]', '工作忙碌了一整天，想吃熱呼呼的下飯菜卻不想進廚房大動干戈？ 我們的「麻婆豆腐燒」選用特製郫縣豆瓣醬，結合大紅袍花椒的微辣與清香，搭配滑嫩紮實的板豆腐與鮮美豬肉末，經慢火熬煮入味。一口咬下，先是豆瓣的鹹香，隨之而來的是花椒微麻的層次感，最後是豆腐的清甜豆香。這不只是一份料理包，更是您餐桌上的救星。', '130.00', '325.00', '12.00', '22.00', '0.00', '18.50', '8.00', '7.00', '1500.00', '250.00', '1.非基因改造板豆腐、國產豬後腿肉末。\r\n2.主廚特調醬汁。', '1.隔水加熱：無需解凍，將內包裝放入沸水中加熱約 5–8 分鐘，撕開倒入碗中即可。\r\n2.微波加熱：解凍後，撕開倒至微波容器中，使用 800W 加熱約 2–3 分鐘。\r\n主廚小撇步： 上桌前撒上新鮮蔥花或少許花椒粉，風味更上一層樓！', '冷凍 -18度 以下可保存 6個月。', '本產品含有大豆、小麥(醬油來源)及其製品。', 1),
(19, '客家小炒', '台式家常系列', '[{\"id\": 55, \"is_cover\": true, \"image_url\": \"img/mall/PROD-019_01.jpg\", \"sort_order\": 1}, {\"id\": 56, \"is_cover\": false, \"image_url\": \"img/mall/PROD-019_02.jpg\", \"sort_order\": 2}, {\"id\": 57, \"is_cover\": false, \"image_url\": \"img/mall/PROD-019_03.jpg\", \"sort_order\": 3}]', '記憶中那道最下飯的客家滋味，現在 5 分鐘就能上桌！我們嚴選特級五花肉與香鮮魷魚，搭配經典五香豆乾，大火快炒出靈魂般的「焦香味」。乾魷魚的鮮味與豬肉油脂完美融合，每一口都是鹹香帶勁。不管是忙碌的晚餐還是深夜的下酒菜，只要加熱，就是餐廳大廚的現炒水準。', '155.00', '525.00', '14.50', '38.00', '0.00', '31.30', '13.00', '8.00', '1500.00', '250.00', '1台灣產豬五花肉。\r\n2.香乾魷魚。\r\n3.豆乾。\r\n4.特製客家醬油。', '1.隔水加熱：水滾後，將料理包(不拆袋)放入沸水中加熱約 3-5 分鐘。\r\n2.微波加熱：拆袋後倒入可微波容器，以 800W 加熱約 2 分鐘。3.大火快炒(最推薦)：拆袋後倒入鍋中，加入少許蔥段快炒 1 分鐘，鑊氣更足！', '冷凍 -18度 以下可保存 6個月。', '本產品含有大豆、小麥、軟體動物類(魷魚)、甲殼類(蝦米)，不適合其過敏體質者食用。', 1),
(20, '藥膳麻油雞湯', '台式家常系列', '[{\"id\": 58, \"is_cover\": true, \"image_url\": \"img/mall/PROD-020_01.jpg\", \"sort_order\": 1}, {\"id\": 59, \"is_cover\": false, \"image_url\": \"img/mall/PROD-020_02.jpg\", \"sort_order\": 2}, {\"id\": 60, \"is_cover\": false, \"image_url\": \"img/mall/PROD-020_03.jpg\", \"sort_order\": 3}]', '寒流來襲的夜晚，最渴望的那一碗暖湯。我們嚴選在地優質仿土雞腿肉，肉質Q彈不軟爛，搭配傳承三代的特級黑麻油與老薑爆香，辛辣中帶點溫潤。不只是麻油雞，我們更加入精心調配的漢方藥膳（當歸、紅棗、枸杞），以傳統工法慢火熬製，湯頭清甜甘潤，絕無化學添加。加熱只需 10 分鐘，讓忙碌的你，隨時都能享受暖胃更暖心的進補饗宴。', '190.00', '585.00', '9.50', '44.00', '0.00', '37.50', '12.00', '8.00', '1200.00', '500.00', '1.嚴選土雞腿肉。\r\n2.主廚特調湯包。', '1. 隔水加熱：不需拆袋，整包放入沸水中加熱約 8-10 分鐘。\r\n2.微波加熱：拆袋後倒入可微波容器，高火加熱約 3-5 分鐘。\r\n3. 電鍋加熱：拆袋倒入碗中，外鍋加半杯水，跳起即可。\r\n美味小撇步：建議可自行加入高麗菜、凍豆腐或麵線，風味更佳！', '冷凍 -18度 以下可保存 6個月。', '本產品含有芝麻(麻油)及其製品。特別提醒：內含米酒與中藥材，孕婦或特殊疾病患者請諮詢醫師後食用。', 1);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`product_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products`
--
ALTER TABLE `products`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
